#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

extern int MAX;

int main()
{

	//取反操作符 ~ 
	//我们说过 整数的存储和计算用的是补码 

	int a = 0;
	// 00000000 00000000 00000000 00000000  补码也是一样的
	int b = ~a;
	// 这里 ~ 意思是 将 a的 二进制序列 也就是补码 按位取反
	
	// 11111111 11111111 11111111 11111111  补码 
	// 11111111 11111111 11111111 11111110  符号位不变 补码二进制序列 - 1得到 反码
	// 10000000 00000000 00000000 00000001  符号位不变 反码 按位取反得到 原码
	
	printf("%d\n", b);// -1








	////左移操作符 <<  
	//
	////对应二进制序列 左移相应位数 空出的部分用0补位  右移也一样
	//int a = 4;
	//// 00000000 00000000 00000000 00000100
	//
	//int b = a << 2;
	//// 00000000 00000000 00000000 00010000             16
	//
	//int b = a << 1;
	//// 00000000 00000000 00000000 00001000             8
	//
	//
	//printf("%d\n", b);


	//int a = -1; //4 byte    32 bit位


	// 原码 10000000 00000000 00000000 00000001  最高位是 1 代表是负数
	// 反码 11111111 11111111 11111111 11111110  原码符号位不变 其他位 按位取反
	// 补码 11111111 11111111 11111111 11111111  反码二进制序列 + 1 得到补码






	// 原码 00000000 00000000 00000000 00000001
	// 反码 00000000 00000000 00000000 00000001
	// 补码 00000000 00000000 00000000 00000001





	//int a = 10;
	//printf("%p\n", a);


	// 十六进制 与 二进制 之间的转换 
	// 1个 十六进制数 = 4 个二进制序列  而对应的转换规则就是 将十六进制用二进制表示
	//十六进制的 (5D)



	//printf("%d\n", sizeof(char));//字符型             1 byte
	//printf("%d\n", sizeof(short));//短整型            2 byte
	//printf("%d\n", sizeof(int));//整形                4 byte
	//printf("%d\n", sizeof(long));//长整型             4 byte
	//printf("%d\n", sizeof(long long));//长整型        4/8 byte
	//printf("%d\n", sizeof(float));//单精度浮点型      4 byte
	////规定long long不同操作系统不一样 32/64 64位上占8字节 但不管在什么操作系统 long long > long 
	//printf("%d\n", sizeof(double));//双精度浮点型     8 byte




	//判断一个整数是否能5整除  
	//输入  包括一个整数M（1≤M≤100, 000）
	//输出  包括一行，如果M可以被5整除就输出YES，否则输出NO（结果大小写敏感）
	//int M = 0;
	//scanf("%d", &M);
	//if (M % 5 == 0)
	//能被5整除 说明最后取得余数为 0   % 为取余数（也称为取模）
	//	printf("YES");
	//else
	//	printf("No");

	


	//printf("%d\n", strlen("C:\168\tasks\bboy.txt"));
	//strlen是求字符串的长度 应该是字节


	//char ch1[] = { "abcdefg" };
	//char ch2[] = { 'a','b','c','d','e','f','g'};

	//printf("%s\n", ch1);
	//printf("%s\n", ch2);

	//printf("ch1= %d\n", strlen(ch1));
	//printf("ch2= %d\n", strlen(ch2));






	////当需要打印一个单引号时
	//char arr1[] = {'\''};
	//printf("%s\n",arr1);
	//
	////当需要打印一个双引号时
	//char arr2[] = {"\""};
	//printf("%s\n",arr2);



	
	//printf("%c\n", 90);// a-z  97-122
	//printf("%d\n",'Z');// A-Z  65-90
	
	return 0;

}